{"text": "Albert Einstein was a theoretical physicist born in Ulm, Germany in 1879. He developed the theory of special relativity in 1905, which revolutionized our understanding of space and time. Einstein worked at the Swiss Patent Office in Bern while developing his groundbreaking papers."}
{"text": "Einstein's general theory of relativity, published in 1915, described gravity as a curvature of spacetime caused by mass and energy. This theory predicted phenomena such as gravitational lensing and the existence of black holes. Arthur Eddington confirmed the theory during a solar eclipse in 1919."}
{"text": "In 1921, Einstein received the Nobel Prize in Physics for his explanation of the photoelectric effect, not for relativity. He emigrated to the United States in 1933 and joined the Institute for Advanced Study at Princeton University, where he worked until his death in 1955."}
{"text": "Marie Curie was a Polish-French physicist and chemist who conducted pioneering research on radioactivity. She was the first woman to win a Nobel Prize and the only person to win Nobel Prizes in two different sciences: Physics in 1903 and Chemistry in 1911."}
{"text": "Curie discovered two elements, polonium and radium, through her research on pitchblende ore. She worked closely with her husband Pierre Curie at the University of Paris. Her research laid the groundwork for the development of X-ray machines used in World War I field hospitals."}
{"text": "Niels Bohr was a Danish physicist who made foundational contributions to understanding atomic structure and quantum theory. He proposed the Bohr model of the atom in 1913, which depicted electrons orbiting the nucleus in discrete energy levels. Bohr received the Nobel Prize in Physics in 1922."}
{"text": "Bohr and Einstein had famous debates about the nature of quantum mechanics throughout the 1920s and 1930s. While Bohr championed the Copenhagen interpretation, Einstein argued that quantum mechanics was incomplete, famously stating that God does not play dice with the universe."}
{"text": "Richard Feynman was an American theoretical physicist known for his work in quantum electrodynamics (QED), for which he shared the Nobel Prize in Physics in 1965. He developed the Feynman diagram notation that simplified calculations of particle interactions and became standard in theoretical physics."}
