{"text": "The Magna Carta, signed in 1215 by King John of England, is considered one of the foundational documents of constitutional law. It established the principle that everyone, including the monarch, is subject to the law and guaranteed rights such as habeas corpus."}
{"text": "The United States Constitution, ratified in 1788, is the oldest written national constitution still in use. It established a system of federalism with separation of powers among three branches: legislative, executive, and judicial."}
{"text": "Stare decisis is a legal principle meaning 'to stand by things decided.' Under this doctrine, courts are bound to follow precedents established by higher courts, ensuring consistency and predictability in legal rulings."}
{"text": "The concept of mens rea, Latin for 'guilty mind,' is a fundamental principle in criminal law requiring that a defendant must have had criminal intent or knowledge of wrongdoing to be found guilty of most crimes."}
{"text": "Tort law governs civil wrongs that cause harm to individuals or property. The three main categories are intentional torts, negligence, and strict liability. Plaintiffs can recover damages for injuries caused by the defendant's conduct."}
{"text": "The doctrine of judicial review, established in Marbury v. Madison (1803), gives courts the power to invalidate laws and government actions that violate the constitution. This principle is fundamental to the American legal system."}
{"text": "Contract law requires four essential elements for a valid agreement: offer, acceptance, consideration, and mutual assent. Without these elements, a contract may be deemed void or voidable in a court of law."}
{"text": "The principle of double jeopardy, protected by the Fifth Amendment, prohibits a person from being prosecuted twice for the same offense after acquittal or conviction. This prevents government harassment through repeated prosecutions."}
{"text": "Habeas corpus, meaning 'produce the body,' is a legal action requiring a person under arrest to be brought before a court. It serves as a crucial safeguard against unlawful detention and arbitrary imprisonment."}
{"text": "The Universal Declaration of Human Rights, adopted by the United Nations in 1948, established fundamental human rights to be universally protected. It has influenced numerous national constitutions and international treaties."}
{"text": "Equity law developed in English courts to provide remedies when common law was inadequate. Equitable remedies include injunctions, specific performance, and rescission, allowing courts to order actions beyond monetary damages."}
{"text": "The exclusionary rule prevents evidence obtained in violation of a defendant's constitutional rights from being used in court. This rule was established to deter police misconduct and protect Fourth Amendment rights."}
{"text": "Res judicata, meaning 'a matter judged,' prevents the same parties from relitigating issues that have already been decided by a court. This promotes finality and efficiency in the legal system."}
{"text": "The adversarial system used in common law countries pits two opposing parties against each other, with a neutral judge or jury deciding the outcome. This contrasts with the inquisitorial system used in civil law countries."}
{"text": "Statutory interpretation involves courts determining the meaning and application of legislation. Methods include textualism, which focuses on plain meaning, and purposivism, which considers legislative intent."}
{"text": "The doctrine of sovereign immunity shields governments from lawsuits without their consent. In the United States, the Federal Tort Claims Act and similar state laws have created limited exceptions to this immunity."}
{"text": "Due process, guaranteed by the Fifth and Fourteenth Amendments, ensures fair treatment through the normal judicial system. It includes both procedural due process and substantive due process protections."}
{"text": "The parol evidence rule prevents parties to a written contract from presenting extrinsic evidence that contradicts or adds to the written terms. This rule promotes certainty in contractual agreements."}
{"text": "Miranda rights, established in Miranda v. Arizona (1966), require police to inform suspects of their right to remain silent and their right to an attorney before custodial interrogation."}
{"text": "The commerce clause of the U.S. Constitution grants Congress the power to regulate interstate commerce. This clause has been broadly interpreted to justify extensive federal regulatory power."}
{"text": "Comparative negligence allocates fault between parties in a tort case, reducing damages proportionally to the plaintiff's own negligence. This replaced the harsher contributory negligence doctrine in most states."}
{"text": "The rule of lenity requires ambiguous criminal statutes to be interpreted in favor of the defendant. This principle reflects the importance of fair notice in criminal law."}
{"text": "Corporate personhood is the legal concept that corporations possess some of the same rights as natural persons, including rights to contract, sue, and be sued, and certain constitutional protections."}
{"text": "The doctrine of promissory estoppel prevents a party from going back on a promise even without consideration, when another party has reasonably relied on that promise to their detriment."}
{"text": "International humanitarian law, also known as the laws of war, regulates the conduct of armed conflict. The Geneva Conventions form the core of these rules protecting civilians and prisoners of war."}
{"text": "The principle of legality in criminal law requires that crimes must be clearly defined by law before conduct can be punished. This is expressed in the Latin maxim nullum crimen sine lege."}
{"text": "Administrative law governs the activities of administrative agencies of government. It includes rule-making, adjudication, and enforcement of regulatory agendas across numerous policy areas."}
{"text": "The doctrine of ultra vires holds that an action taken beyond the legal power or authority of a corporation, government body, or official is void and without legal effect."}
{"text": "Property law distinguishes between real property (land and fixtures) and personal property (movable items). Different rules govern the transfer, use, and protection of each type."}
{"text": "The cy pres doctrine in trust law allows courts to modify the terms of a charitable trust when its original purpose becomes impossible, substituting a similar charitable purpose."}
{"text": "Intellectual property law protects creations of the mind through patents, copyrights, trademarks, and trade secrets. Each form of protection serves different purposes and has different requirements."}
{"text": "The doctrine of forum non conveniens allows courts to dismiss cases when another forum would be more appropriate for hearing the dispute, considering factors like witness convenience and applicable law."}
