{"text": "Newton's three laws of motion, published in 1687, form the foundation of classical mechanics. The first law describes inertia, the second relates force to acceleration (F=ma), and the third states that every action has an equal and opposite reaction."}
{"text": "The Standard Model of particle physics describes fundamental particles and three of the four fundamental forces. It includes six quarks, six leptons, and force-carrying bosons like photons, gluons, and the W and Z bosons."}
{"text": "Quantum entanglement occurs when particles become correlated such that the quantum state of each cannot be described independently. Einstein called this spooky action at a distance, but experiments have confirmed its reality."}
{"text": "The Heisenberg uncertainty principle states that the more precisely a particle's position is known, the less precisely its momentum can be known, and vice versa. This is a fundamental limit of measurement in quantum mechanics."}
{"text": "E=mc², derived by Einstein in 1905, establishes the equivalence of mass and energy. This equation explains nuclear reactions and shows that a small amount of mass can be converted into enormous amounts of energy."}
{"text": "Thermodynamics is governed by four laws: the zeroth law defines thermal equilibrium, the first law conserves energy, the second law establishes entropy increase, and the third law describes behavior near absolute zero."}
{"text": "The photoelectric effect, explained by Einstein in 1905, demonstrated that light consists of discrete packets called photons. This work, which earned Einstein the Nobel Prize, was crucial evidence for quantum theory."}
{"text": "Black holes are regions of spacetime where gravity is so strong that nothing, not even light, can escape. Predicted by general relativity, they form when massive stars collapse and were first imaged by the Event Horizon Telescope in 2019."}
{"text": "The Higgs boson, discovered at CERN in 2012, is associated with the Higgs field that gives particles their mass. Peter Higgs and François Englert received the Nobel Prize for predicting its existence in the 1960s."}
{"text": "Wave-particle duality describes how quantum objects exhibit both wave-like and particle-like properties depending on how they are observed. The double-slit experiment famously demonstrates this fundamental quantum phenomenon."}
{"text": "Superconductivity is a phenomenon where certain materials conduct electricity with zero resistance below a critical temperature. First discovered by Heike Kamerlingh Onnes in 1911, it enables technologies like MRI machines and particle accelerators."}
{"text": "The speed of light in a vacuum is approximately 299,792,458 meters per second. According to special relativity, this speed represents an absolute cosmic speed limit that no massive object can reach."}
{"text": "Electromagnetic waves include radio waves, microwaves, infrared, visible light, ultraviolet, X-rays, and gamma rays. They all travel at the speed of light but differ in frequency and wavelength."}
{"text": "The weak nuclear force is responsible for radioactive decay and nuclear fusion in stars. It is mediated by W and Z bosons and is the only force that can change one type of quark into another."}
{"text": "The strong nuclear force binds quarks together to form protons and neutrons, and binds these nucleons together in atomic nuclei. It is the strongest of the four fundamental forces but acts only at very short ranges."}
{"text": "Schrödinger's equation describes how quantum states evolve over time. The wave function solution provides probability amplitudes for finding particles in various states when measured."}
{"text": "Gravitational waves are ripples in spacetime caused by accelerating massive objects. First detected by LIGO in 2015 from merging black holes, they confirmed a prediction of general relativity."}
{"text": "The Doppler effect describes the change in frequency of a wave when the source and observer are in relative motion. It explains redshift in astronomy and is used in radar and medical ultrasound."}
{"text": "Antimatter consists of particles with opposite charge and quantum numbers to ordinary matter. When matter and antimatter meet, they annihilate and convert entirely to energy according to E=mc²."}
{"text": "The Pauli exclusion principle states that no two identical fermions can occupy the same quantum state simultaneously. This explains the structure of atoms and why matter takes up space."}
{"text": "Nuclear fission splits heavy atomic nuclei into lighter fragments, releasing enormous energy. This process powers nuclear reactors and atomic bombs, using chain reactions of neutron-induced fission."}
{"text": "Nuclear fusion combines light atomic nuclei to form heavier ones, releasing even more energy per unit mass than fission. The Sun's energy comes from hydrogen fusion into helium at its core."}
{"text": "Maxwell's equations unify electricity and magnetism into a single framework of electromagnetism. They predict electromagnetic waves and show that light is an electromagnetic phenomenon."}
{"text": "The photoelectric effect shows that electrons are ejected from metals when illuminated with light above a threshold frequency. The kinetic energy of ejected electrons depends on light frequency, not intensity."}
{"text": "Cosmic microwave background radiation is the thermal radiation left over from the early universe, about 380,000 years after the Big Bang. Its discovery in 1965 strongly supports the Big Bang theory."}
{"text": "Quantum tunneling allows particles to pass through barriers that classical physics would consider impenetrable. This phenomenon enables nuclear fusion in stars and is exploited in scanning tunneling microscopes."}
{"text": "Dark matter makes up about 27% of the universe but does not emit or absorb light. Its existence is inferred from gravitational effects on visible matter, galaxy rotation curves, and gravitational lensing."}
{"text": "Dark energy accounts for about 68% of the universe and drives its accelerating expansion. Its nature remains one of the greatest mysteries in modern physics."}
{"text": "Relativistic effects become significant when objects move at speeds approaching the speed of light. Time dilation causes moving clocks to run slower, and length contraction shortens objects in the direction of motion."}
{"text": "The conservation laws of physics state that energy, momentum, angular momentum, and electric charge are conserved in isolated systems. These laws derive from fundamental symmetries of nature."}
{"text": "Lasers produce coherent light through stimulated emission, where excited atoms release photons in phase with passing light. Applications range from barcode scanners to surgery to fiber optic communications."}
{"text": "Quantum chromodynamics (QCD) describes the strong force interactions between quarks and gluons. Unlike electromagnetism, the strong force increases with distance, leading to quark confinement in hadrons."}
