{"content": "The time value of money is a fundamental financial principle stating that a dollar today is worth more than a dollar in the future. This concept underlies present value calculations, discounting, and investment analysis.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Capital Asset Pricing Model (CAPM), developed by William Sharpe in 1964, describes the relationship between systematic risk and expected return. It uses beta to measure an asset's sensitivity to market movements.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Compound interest, described by Einstein as the eighth wonder of the world, generates returns on both principal and accumulated interest. The formula A = P(1 + r/n)^(nt) calculates the final amount over time.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Efficient Market Hypothesis (EMH) suggests that stock prices reflect all available information, making it impossible to consistently outperform the market. It comes in weak, semi-strong, and strong forms based on information scope.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Portfolio diversification reduces risk by spreading investments across different assets that are not perfectly correlated. Harry Markowitz's Modern Portfolio Theory provides mathematical framework for optimal asset allocation.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Federal Reserve, established in 1913, is the central bank of the United States. It controls monetary policy through interest rates, open market operations, and reserve requirements to maintain price stability and employment.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Derivatives are financial instruments whose value is derived from underlying assets like stocks, bonds, or commodities. Options, futures, and swaps are common derivatives used for hedging and speculation.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Black-Scholes model, published in 1973 by Fischer Black and Myron Scholes, provides a formula for pricing European options. It revolutionized financial markets and earned Scholes a Nobel Prize in Economics.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Leverage in finance refers to using borrowed capital to increase potential returns on investment. While leverage can amplify gains, it equally magnifies losses and increases financial risk.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The yield curve plots interest rates of bonds with equal credit quality but different maturity dates. An inverted yield curve, where short-term rates exceed long-term rates, is often considered a recession indicator.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Basel III regulations, implemented after the 2008 financial crisis, require banks to maintain higher capital reserves and liquidity ratios. These standards aim to strengthen bank resilience and reduce systemic risk.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Arbitrage is the practice of profiting from price differences of identical assets in different markets. In efficient markets, arbitrage opportunities are quickly eliminated as traders exploit them.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The price-to-earnings (P/E) ratio measures a company's stock price relative to its earnings per share. It is widely used to assess whether a stock is overvalued or undervalued compared to peers or historical averages.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Net present value (NPV) calculates the current value of future cash flows minus initial investment. A positive NPV indicates a profitable investment, making it a fundamental tool for capital budgeting decisions.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Credit default swaps (CDS) are derivatives that transfer credit risk between parties. They played a significant role in the 2008 financial crisis by obscuring counterparty risk in the financial system.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Sharpe ratio measures risk-adjusted returns by dividing excess return over the risk-free rate by standard deviation. Higher Sharpe ratios indicate better risk-adjusted performance of an investment.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Market capitalization is calculated by multiplying a company's stock price by its outstanding shares. Companies are typically classified as large-cap, mid-cap, or small-cap based on this metric.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Quantitative easing (QE) is an unconventional monetary policy where central banks purchase government securities to increase money supply and lower long-term interest rates when conventional policy is insufficient.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Value at Risk (VaR) estimates the maximum potential loss of an investment portfolio over a specified time period at a given confidence level. It is a standard measure for financial risk management.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The Modigliani-Miller theorem states that in perfect markets, a company's value is independent of its capital structure. This foundational corporate finance theory assumes no taxes, bankruptcy costs, or information asymmetry.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Behavioral finance studies how psychological factors influence financial decisions. Concepts like loss aversion, overconfidence, and herd mentality explain market anomalies that traditional finance cannot.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Initial public offerings (IPOs) allow private companies to raise capital by selling shares to public investors. The underwriting process involves investment banks pricing and distributing the new shares.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The foreign exchange market (forex) is the largest financial market globally, with over $6 trillion traded daily. Exchange rates are determined by supply and demand factors including interest rates and trade balances.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Bonds are fixed-income securities where investors lend money to issuers in exchange for periodic interest payments and return of principal. Bond prices move inversely to interest rates.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Hedge funds are alternative investment vehicles that use diverse strategies including long-short equity, global macro, and event-driven approaches. They typically require high minimum investments and charge performance fees.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The cost of capital represents the required return necessary to make an investment worthwhile. It combines the cost of debt and cost of equity weighted by their proportions in the capital structure.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Inflation erodes purchasing power over time, making future cash flows worth less in real terms. Central banks target low, stable inflation rates, typically around 2% annually in developed economies.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Technical analysis examines price charts and trading volumes to forecast future price movements. Common tools include moving averages, relative strength index (RSI), and candlestick patterns.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Mutual funds pool money from multiple investors to purchase diversified portfolios of securities. They offer professional management and diversification to individual investors at relatively low costs.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "The debt-to-equity ratio measures a company's financial leverage by dividing total liabilities by shareholders' equity. Higher ratios indicate greater reliance on debt financing and potentially higher risk.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Venture capital provides funding to early-stage companies with high growth potential in exchange for equity stakes. VC firms typically invest through multiple funding rounds as companies develop.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
{"content": "Exchange-traded funds (ETFs) trade like stocks but hold diversified portfolios of assets. They offer lower expense ratios than mutual funds and allow intraday trading with real-time pricing.", "tags": ["finance"], "category": "Finance", "retrieval_count": 0}
